using System;

namespace 트리_트리_이론
{
    class Program
    {
        static void Main(string[] args)
        {
            // 트리란 계층적 구조를 갖는 데이터를 표현하기 위한 자료구조
            // 노드와 간선으로 구성

            // 트리도 그래프의 일종이나 순환구조가 있으면 안된다,
            // 트리에 사용하는 용어들은 굉장히 많음
            // 부모노드 - 상하관계에 있는 노드 중 위쪽 노드
            // 자식노드 - 상하관계에 있는 노드 중 아래쪽 노드
            // 형제노드 - 부모를 가지고 있고 같은 레이어에 있는 노드
            // 선조노드 - 연결된 가장 높은 노드
            // 자손노드 - 연결된 가장 낮은 노드
            // 노드의 깊이 - 최상위 노드를 기준으로 멀리 갈 수 있는 거리
            // 트리의 높이 - 최하위 노드를 기준으로 멀리 갈 수 있는 거리
            // 서브트리 - 트리 내부에 있는 작은 트리
        }
    }
}
