using System;

namespace 그래프_그래프_이론
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
            // 현실 세계의 사물이나 추상적인 개념 간의 연결 관계를 표현한다
            // 그래프는 정점(Vertex), 간선(Edge)로 구성되어있다.
            // 이것이 전부이나 응용가능한 분야가 무궁무진하다.
            // 그래프는 일반 그래프, 가중치 그래프, 방향 그래프 등 다양한 그래프가 있다.
            // 
            // 그래프 구현
            // 연결리스트로 구현이 가능할 수도 있지만 매번 vertex를 생성해야한다는 단점이 있다
            // 리스트로 구현한다면 vertex 인스턴스 생성 부담을 줄일 수 있다 그러나 속도가 느리다는
            // 단점이 있다.
            // 2차원 행렬을 이용하여 구현하면 접근속도를 훨씬 올릴 수 있다.
            // 그러나 메모리 소모가 심하다.
        }
    }
}